01  WS-AREA. 
    05  WS-AMOUNT PIC 9(7)V99 VALUE 0. 
    05  WS-COUNT PIC 9(3) VALUE 0.

PROCEDURE DIVISION.
    PERFORM VARYING WS-COUNT FROM 1 BY 1 UNTIL WS-COUNT > 10
        ADD 10.25 TO WS-AMOUNT
    END-PERFORM.
    DISPLAY "Total amount:" WS-AMOUNT.
    STOP RUN.